nathanbegin/ESP-C6-UNIT01/sdkconfig.defaults
# Cible
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Module relais : vérifier la polarité et les délais du matériel.
CONFIG_APP_RELAY_ACTIVE_LOW=y
CONFIG_APP_RELAY_SETTLE_MS=30

# Table de partitions personnalisée
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Zigbee : rôle ZCZR (Router/Coordinator capable) — requis pour un routeur,
# fonctionne aussi pour End Device.
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCZR=y
CONFIG_ZB_RADIO_NATIVE=y

# Pile principale plus grande pour la stack Zigbee
CONFIG_FREERTOS_HZ=1000

# Active la radio 802.15.4 native du C6
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
